app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT `usuarios`.* FROM `usuarios`

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`codUsu`, `nombreUsu`, `created_at`, `updated_at`) VALUES ('001', 'Lisseth', '2015-05-21 01:47:41', '2015-05-21 01:47:41')

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1